{
  "Home" : "Acceuil",
  "About": "A Propos de Moi",
  "Portfolio": "Portfolio",
  "Contact": "Contact",
  "Welcome": "Bienvenue dans mon monde",
  "HomeTitle": "Bonjour 👋, Je suis Mouhamed DIAGNE.",
  "JobTitle1": "Développeur FullStack",
  "JobTitle2": "DevOps Junior",
  "JobTitle3": "Amoureux de Java",
  "JobTitle4": "Passioné de Réseaux",
  "JobTitle5": "Passionné de CyberSécurité",
  "Description": "Je suis un développeur web sénégalais passionné, spécialisé dans la création de solutions numériques sur mesure.     Mon engagement est de transformer vos idées en réalités numériques élégantes et fonctionnelles, en mettant toujours l'utilisateur au centre de mes préoccupations",
  "More": "En savoir plus",
  "IntroTitle": "Mon introduction",
  "IntroductionText": "Bonjour ! Je suis Mouhamed DIAGNE, j'ai 21 ans et suis un élève ingénieur logiciel à <a href=\"https://www.esp.sn\" class=\"text-blue-600 hover:text-blue-800\"> l'ESP de DAKAR </a> basé au Sénégal. Avec une solide expérience en développement d'applications web et mobiles, ainsi qu'une connaissance en sécurité des applications, je me consacre à créer des solutions logicielles sécurisées et performantes pour répondre aux besoins uniques de mes clients.Ce qui me motive, c'est le défi de transformer des idées en applications fonctionnelles et impactantes tout en assurant leur sécurité et leur performance. Je crois fermement en la puissance de la collaboration, l'attention méticuleuse aux détails et un engagement inébranlable envers la qualité du code et la sécurité. N'hésitez pas à explorer mon portfolio pour découvrir certains des projets sur lesquels j'ai travaillé, et n'hésitez pas à me contacter si vous souhaitez collaborer !",
  "Experience": "Années d'expérience",
  "Projects":"Projets réalisés",
  "Works": "Entreprises",
  "SkillsTitle": "Mes Compétences",
  "TechnicalSkills": "Compétences Techniques",
  "Beginner": "Débutant",
  "Intermediate": "Intermédiaire",
  "Advanced": "Avancé",
  "ProfessionalSkills": "Compétences Professionnelles",
  "Creativity": "Creativité",
  "ProblemSolving": "Résolution de Problèmes",
  "Communication": "Communication",
  "Teamwork": "Travail d'Equipe",
  "Education&ExperienceTitle": "Education & Expérience"
}